from settings import TG_URL

HI_ANSWER = f'Привет! Я помогу отправить твое фото в канал [Лифтолук]({TG_URL}), пожалуйста, пришли мне его 🙂'
WELCOME_BACK_ANSWER = f'С возвращением! Присылай скорее свой новый лифтолук 🙂\n\nПока я ещё маленький ботик и могу обработать только одну карточку - но скоро научусь принимать видео и несколько фоток'
BYE_ANSWER = 'Отправляю собирать лайки 🙂'
ONE_MORE_PHOTO_ANSWER = 'Присылай свой лифтолук 🙂\n\nПока я ещё маленький ботик и могу обработать только одну карточку - но скоро научусь принимать видео и несколько фоток'
FEEDBACK_ANSWER = 'Отправь, пожалуйста, в одном сообщении пожелания для улучшения бота или просто свой отзыв 🙂 Это анонимно.\nЕсли ты передумал - жми /cancel'
THANKS_FOR_FEEDBACK_ANSWER = 'Спасибо большое <3'
THANKS_FOR_FEEDBACK_ANYWAY_ANSWER = 'Жду тебя с новыми луками <3'

# Main answers
AWESOME_PHOTO_ANSWER = 'Как всегда великолепно!\nЛифтолук сделан сегодня?'
SEND_CITY_ANSWER = 'Клёво! Подскажи город, в котором сделан лифтолук'
SEND_DATE_ANSWER = 'Напиши пожалуйста, когда был снят лифтолук, в формате DD.MM.YYYY'
SEND_NEW_CITY_ANSWER = 'Пришли пожалуйста название города'

# Validation errors
OLD_PHOTO_ANSWER = 'В канале разрешены только луки, сделанные недавно'
PHOTO_FROM_FUTURE_ANSWER = 'Если ты умеешь путешествовать во времени, то ты знаешь, что нужно сделать. Если просто ошибся - введи корректную дату'
USE_FORMAT_ANSWER = 'Попробуй еще раз, используя формат DD.MM.YYYY'
WAIT_PHOTO_ANSWER = 'Я ожидаю фото 🙂'
WAIT_CITY_ANSWER = 'Напиши пожалуйста город текстом 🙂'
WAIT_CALLBACK_ANSWER = 'Нажми на кнопку в сообщении выше 🙂'
WAIT_DATE_ANSWER = 'Напиши пожалуйста дату текстом 🙂'
WAIT_FEEDBACK_ANSWER = 'Напиши пожалуйста отзыв или пожелания текстом 🙂'

# Bot Errors
ERROR_ANSWER = 'Что-то пошло не так, попробуй еще раз'
NO_PHOTO_ANSWER = 'Хм, не могу найти лифтолук. Попробуй пожалуйста отправить его снова: /start'
STOP_ANSWER = 'Для повторного запуска бота выбери команду: /start'

# For Keyboards
SEND_MORE_KEYBOARD = 'Отправить еще фото'
CHECK_CHANNEL_KEYBOARD = 'Посмотреть в Лифтолук'
SEND_FEEDBACK_KEYBOARD = 'Отправить пожелания боту'